package LastPractick.TestEpam;

public class Test40 {

}

/*
*
*Можно ли при объявлении класса использовать модификаторы abstract и final одновременно?
*
*
*Ответ: Нет
*
*
*Потому что: Эти два модификатора являются взаимоисключающими:
– abstract используется, чтобы показать, что класс имеет неполную реализацию, или его следует рассматривать таковым;
– final применяется к полностью реализованным классам, для которых не нужны (нежелательны) подклассы, чтобы обеспечить надёжность и/или производительность.
*
*
*
*
*
* */
